In [5]:
import json

# Assuming 'a.json' is in the specified path
file_path = r'D:\Data Anlayst\NeenOpal\a.json'

# Open and read the JSON file
with open(file_path, 'r') as file:
    data = json.load(file)

In [8]:
# Find the entry with entityId "200"
desired_entity_id = "200"
desired_entity = next((entity for entity in data if entity["entityId"] == desired_entity_id), None)

# Check if the entity with entityId "200" exists
if desired_entity:
    # Access the account details for entityId "200"
    account_details = desired_entity["accountDetails"]
    print(account_details)
else:
    print(f"No entity found with entityId {desired_entity_id}")

[{'accNumber': 87990, 'ifscCode': 'SBI001'}, {'accNumber': 9888, 'ifscCode': 'SBI002'}]

In [53]:
import random
import pandas as pd

def generate_data(num):
    data = {
        'Id': [i+1 for i in range(num)],
        'Name': [f'person{i+1}' for i in range(num)],
        'Age': [random.randint(18, 65) for _ in range(num)],
        'Salary': [random.randint(30000, 1000000) for _ in range(num)]
    }
    return data

# Function to create a dataset and export it to a CSV file
def create_and_export_dataset(num, file_path):
    data = generate_data(num)
    df = pd.DataFrame(data)
 
    # Export the DataFrame to a CSV file
    df.to_csv(file_path, index=False)
    print(f'Dataset exported to {file_path}')

if __name__ == "__main__":
    # Set the number of records you want in the dataset
    num_records = 100
    
    # Set the file path for the CSV file
    csv_file_path = 'D:\\generated_dataset.csv'
    
    # Create and export the dataset
    create_and_export_dataset(num_records, csv_file_path)

Dataset exported to D:\generated_dataset.csv

In [61]:
   df.loc[0,'Salary']=79690

In [62]:
df

     Id       Name  Age  Salary
0     1    person1   32   79690
1     2    person2   34   79690
2     3    person3   25  691982
3     4    person4   31  770016
4     5    person5   44   63082
..  ...        ...  ...     ...
95   96   person96   58  984275
96   97   person97   61  203104
97   98   person98   36  327480
98   99   person99   43  557593
99  100  person100   34  754408

[100 rows x 4 columns]

In [46]:
df=pd.read_csv('D:\\generated_dataset.csv')

In [63]:
# Find persons with the same salary
duplicate_salaries = df[df.duplicated('Salary', keep=False)]

# Display the persons with the same salary
print("Persons with the same salary:")
print(duplicate_salaries[['Name', 'Salary']])

Persons with the same salary:
      Name  Salary
0  person1   79690
1  person2   79690

In [69]:
df_sorted = df.sort_values(by='Salary', ascending=False)
df_sorted

    Id      Name  Age  Salary
78  79  person79   31  993472
94  95  person95   41  990794
95  96  person96   58  984275
73  74  person74   60  980809
93  94  person94   51  979383
..  ..       ...  ...     ...
84  85  person85   30   73749
4    5   person5   44   63082
54  55  person55   52   60907
57  58  person58   20   43462
45  46  person46   42   33264

[100 rows x 4 columns]

In [30]:
pip install tabulate

Requirement already satisfied: tabulate in c:\users\one\anaconda3\lib\site-packages (0.8.10)Note: you may need to restart the kernel to use updated packages.

In [32]:
a = [1,2,3,4,5,6,7,8,9]

In [42]:
 print(a[::-1])

[9, 8, 7, 6, 5, 4, 3, 2, 1]

In [70]:
data=[
  {
    "entityId": "200",
    "accountDetails": [
      {
        "accNumber": 87990,
        "ifscCode": "SBI001"
      },
      {
        "accNumber": 9888,
        "ifscCode": "SBI002"
      }
    ]
  },
  {
    "entityId": "201",
    "accountDetails": [
      {
        "accNumber": 74321,
        "ifscCode": "HDFC002"
      },
      {
        "accNumber": 72323,
        "ifscCode": "HDFC001"
      }
]
},
{
"entityId": "202",
"accountDetails": [
{
"accNumber": 8761,
"ifscCode": "HDFC001"
}
]
}
]

In [73]:
# Create the pandas DataFrame
df = pd.DataFrame(data, columns=['entityId', 'accountDetails','accNumber','ifscCode'])

In [74]:
df

,entityId,accountDetails,accNumber,ifscCode
0,200,"[{'accNumber': 87990, 'ifscCode': 'SBI001'}, {...",NaN,NaN
1,201,"[{'accNumber': 74321, 'ifscCode': 'HDFC002'}, ...",NaN,NaN
2,202,"[{'accNumber': 8761, 'ifscCode': 'HDFC001'}]",NaN,NaN

In [78]:

# Flatten the nested data structure
flattened_data = [
    {"entityId": item["entityId"], **account} for item in data for account in item["accountDetails"]
]

# Create a DataFrame from the flattened data
df = pd.DataFrame(flattened_data)

# Display the DataFrame
print(df)

  entityId  accNumber ifscCode
0      200      87990   SBI001
1      200       9888   SBI002
2      201      74321  HDFC002
3      201      72323  HDFC001
4      202       8761  HDFC001

In [3]:
import pandas as pd

# create a dictionary
data = {'Name': ['John', 'Alice', 'Bob'],
       'Age': [25, 30, 35],
       'City': ['New York', 'London', 'Paris']}

# create a dataframe from the dictionary
df = pd.DataFrame(data)

print(df)

    Name  Age      City
0   John   25  New York
1  Alice   30    London
2    Bob   35     Paris

In [4]:
# create a dictionary
data1 = {'Name': ['John', 'Alice', 'Bob'],
       'payment': [2500, 3000, 3500],
       'City': ['New York', 'London', 'Paris']}

# create a dataframe from the dictionary
df1 = pd.DataFrame(data1)

print(df1)

    Name  payment      City
0   John     2500  New York
1  Alice     3000    London
2    Bob     3500     Paris

In [9]:
# Merge the two DataFrames based on the 'Name' column
merged_df = pd.merge(df, df1, on='City')

In [10]:
merged_df

  Name_x  Age      City Name_y  payment
0   John   25  New York   John     2500
1  Alice   30    London  Alice     3000
2    Bob   35     Paris    Bob     3500